app/views/incidents/index.html.erb

	<ul>
		<% incident.students.each do |student| %>
---
SELECT "students".* FROM "students" INNER JOIN "student_incidents" ON "students"."id" = "student_incidents"."student_id" WHERE "student_incidents"."incident_id" = ?  [["incident_id", 1]]