app/controllers/incidents_controller.rb

SELECT "incidents".* FROM "incidents"
---
	def index
		@incidents = Incident.all

INSERT INTO "incidents" ("created_at", "date_time", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-01-24 20:03:06.856605"], ["date_time", "yesterday"], ["updated_at", "2015-01-24 20:03:06.856605"]]
---
	def create
		@incident = Incident.new(incident_params)

		if @incident.save